Repository: amrbass/local-weather-data
Catalog: local-weather/languages/local-weather-*.po
Languages: ca

source: Local Weather
ca: Temps Local

source: Local Weather Settings
ca: Configuració de Temps Local

source: Settings
ca: Configuració

source: There was an error adding this setting. Please try again. If this persists, shoot us an email.
ca: S'ha produit un error afegint aquest paràmetre. Torna-ho a provar i, si persisteix, contacte amb nosaltres.

source: Basic options:
ca: Opcions bàsiques:

source: (2 letters country code)
ca: (codi de país de 2 lletres)

source: 1) Country code:
ca: 1) Codi de País:

source: (a valid postal code)
ca: (un codi postal vàlid)

source: 2) Postal code:
ca: 2) Codi postal:

source: (standard, metric or imperial)
ca: (standard, metric o imperial)

source: 3) Units:
ca: 3) Unitats:

source: (32 chars alphanumeric key)
ca: (clau alfanumèrica de 32 caràcters)

source: 4) OpenWeatherMap API Key:
ca: 4) Clau API d'OpenWeatherMap:

source: %1$sEnter the default setting values to be used by %2$sLocal Weather%3$s. See parameters description below.%4$s
ca: %1$sIntroduir els paràmetres per defecte per a %2$sTemps Local%3$s. Veure la descripció més avall.%4$s

source: %1$sCountry code:%2$s a 2 letters contry code as defined in ISO 3166-1 alpha-2.%3$s
ca: %1$sCodi de país:%2$s codi de 2 lletres com es defineix a ISO 3166-1 alpha-2.%3$s

source: %1$sPostal code:%2$s your target area postal code.%3$s
ca: %1$sCodi postal:%2$s el codi postal de la ubicació d'interès.%3$s

source: %1$sUnits:%2$s required measurement units system (standard, metric, imperial)%3$s
ca: %1$sUnitats:%2$s tipus d'unitats a utilitzar (standard, metric, imperial)%3$s

source: %1$sYour own OpenWeatherMap API Key%2$s (do not share nor publish)%3$s
ca: %1$sLa teva clau API per a OpenWeatherMap%2$s (no la comparteixis ni la publiquis)%3$s

source: Display weather data from %1$sOpenWeatherMap%2$s.
ca: Mostrar dades del temps proporcionades per %1$sOpenWeatherMap%2$s.

source: In your selected page/post, insert a %1$sshortcode%2$s. See these shortcode format examples:
ca: Inserir un %1$sshortcode%2$s a la Pàgina / Entrada corresponent. Seguir el format d'aquests exemples:

source: Your own OpenWeatherMap API Key required! Get yours at
ca: Cal disposar d'una clau per a l'API d'OpenWeatherMap! Pots obtenir la teva a

source: Generate a shortcode according to your current settings
ca: Generar un 'shortcode' segons la configuració actual

source: (copy and paste into the required place)
ca: (copiar i enganxar al lloc corresponent)

source: Based on WordPress %1$sBoilerplate%2$s plugin example.
ca: Basat en l'exemple %1$sBoilerplate%2$s de plugin per a WordPress.

source: Plugin web link
ca: Enllaç a la pàgina web d'aquest plugin

source: bad country code
ca: codi de país incorrecte

source: %1$s Error: %2$s for postal code "%3$s" and country code "%4$s" (%5$s).%6$s
ca: %1$s Error: %2$s per codi postal "%3$s" i codi de país "%4$s" (%5$s).%6$s

source: D, M j, Y H:i
ca: D j M Y H:i

source: %1$sThe weather now in %2$s%3$s%4$s%5$s
ca: %1$sEl temps ara a %2$s%3$s%4$s%5$s

source: %1$sThe weather now in %2$s (%3$s)%4$s%5$s%6$s
ca: %1$sEl temps ara a %2$s (%3$s)%4$s%5$s%6$s

source: %1$sTemperature: %2$s %3$s%4$s(feels like %5$s %3$s)%6$s
ca: %1$s Temperatura: %2$s %3$s%4$s (sensació de %5$s %3$s)%6$s

source: %1$sHumidity: %2$s %3$s%4$sPressure: %5$s %6$s%7$s
ca: %1$sHumitat: %2$s %3$s%4$sPressió: %5$s %6$s%7$s

source: %1$sCloudiness: %2$s %3$s%4$sVisibility: %5$s %6$s%7$s
ca: %1$sNuvolositat: %2$s %3$s%4$sVisibilitat: %5$s %6$s%7$s

source: %1$s🌻 Air quality:%2$s%3$s%4$s
ca: %1$s🌻 Qualitat aire:%2$s%3$s%4$s

source: Calm
ca: Calma

source: Light air
ca: Ventolina

source: Light breeze
ca: Vent fluixet

source: Gentle breeze
ca: Vent fluix

source: Moderate breeze
ca: Vent moderat

source: Fresh breeze
ca: Vent fresquet

source: Strong breeze
ca: Vent fresc

source: Moderate gale
ca: Vent fort

source: Gale
ca: Temporal

source: Strong gale
ca: Temporal fort

source: Storm
ca: Temporal molt fort

source: Violent storm
ca: Temporal violent

source: Hurricane
ca: Huracà

source: unknown value
ca: valor desconegut

source: VERY GOOD 🌻
ca: MOLT BONA 🌻

source: GOOD 😀
ca: BONA 😀

source: MEDIUM 😐
ca: MODERADA 😐

source: BAD 🙁
ca: DOLENTA 🙁

source: >100 VERY BAD 🤢
ca: >100 MOLT DOLENTA 🤢
